tests/TVMIOwithChangingWindDir/constant/ABLProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          ABLProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"

// Automatically update fixesValue for timeVaryingMappedInletOutlet boundaries
updateFixesValue  true;


// Properties of the background forcing source term
momentumSource
{
    type        "given";
    inputType   "components";

    //Relaxation factor (only used when type is "computed")
    gain        0.7;

    sourceHeightsMomentum
    (
        $windControlHeight
    );
    
    sourceTableMomentumX
    (
        (    0.0 0.0)
        (90000.0 0.0)
    );
    
    sourceTableMomentumY
    (
        (    0.0 0.0)
        (90000.0 0.0)
    );
    
    sourceTableMomentumZ
    (
        (    0.0 0.0)
        (90000.0 0.0)
    );
}

temperatureSource
{
    type        "given";

    //Relaxation factor (only used when type is "computed")
    gain        0.7;

    sourceHeightsTemperature
    (
        $windControlHeight
    );
    
    sourceTableTemperature
    (
        (    0.0 0.0)
        (90000.0 0.0)
    );
}

// Properties of the Coriolis force
planetaryRotationPeriod   $EarthPeriod;
latitude                  $latitude;

// ************************************************************************* //
