tests/TVMIOwithChangingWindDir/0.original/Rwall
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      Rwall;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform (0.0 0.0 0.0 0.0 0.0 0.0);

boundaryField
{
    lower
    {
//        type            SchumannGrotzbach;
//        kappa           $kappa;
//        z0              uniform $z0;
//        betaM           $betaM;
//        gammaM          $gammaM;
//        averageType     $wallModelAverageType;
//        value           uniform $Rwall;
        type            fixedValue;
        value           $internalField;
    }
    upper
    {
        type            fixedValue;
        value           $internalField;
    }
    west 
    {
        type            fixedValue;
        value           $internalField;
    }
    east 
    {
        type            fixedValue;
        value           $internalField;
    }
    north 
    {
        type            fixedValue;
        value           $internalField;
    }
    south
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
