tests/TVMIOwithChangingWindDir/0.original/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"


dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $nut0;

boundaryField
{
    lower
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    upper
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    west
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    east
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    south
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    north
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
}


// ************************************************************************* //
