tests/TVMIOwithChangingWindDir/system/sampling/sliceDataInstantaneous
      sliceDataInstantaneous
      {
          type                  surfaces;
          functionObjectLibs    ("libsampling.so");
          enabled               true;
          interpolationScheme   cell;
          writeControl          adjustableRunTime;
          writeInterval         1;
          surfaceFormat         vtk;
          fields
          (
              U
          );
          surfaces
          (
              slice_horizontal
              {
                  type          cuttingPlane;
                  planeType     pointAndNormal;
                  pointAndNormalDict
                  {
                      basePoint     (0.001 0.001 250.0);
                      normalVector  (0 0 1);
                  }
                  interpolate   true;
              }
          );
      }
