tests/TVMIOwithChangingWindDir/system/sampling/virtualMetMast
    refMet
    {
        type                probes;
        functionObjectLibs ("libsampling.so");
        name                refMet;
        writeControl        timeStep;
        writeInterval       1;
        fields
        (
            U
        );

        probeLocations
        (
            (0.001 0.001  10.0)
            (0.001 0.001  30.0)
            (0.001 0.001  50.0)
            (0.001 0.001  70.0)
            (0.001 0.001  90.0)
            (0.001 0.001 110.0)
            (0.001 0.001 130.0)
            (0.001 0.001 150.0)
            (0.001 0.001 170.0)
            (0.001 0.001 190.0)
            (0.001 0.001 210.0)
            (0.001 0.001 230.0)
            (0.001 0.001 250.0)
            (0.001 0.001 270.0)
            (0.001 0.001 290.0)
            (0.001 0.001 310.0)
            (0.001 0.001 330.0)
            (0.001 0.001 350.0)
            (0.001 0.001 370.0)
            (0.001 0.001 390.0)
            (0.001 0.001 410.0)
            (0.001 0.001 430.0)
            (0.001 0.001 450.0)
            (0.001 0.001 470.0)
            (0.001 0.001 490.0)
        );
    }
    southMet
    {
        type                probes;
        functionObjectLibs ("libsampling.so");
        name                southMet;
        writeControl        timeStep;
        writeInterval       1;
        fields
        (
            U
        );

        probeLocations
        (
            (0.001 -490.0  10.0)
            (0.001 -490.0  30.0)
            (0.001 -490.0  50.0)
            (0.001 -490.0  70.0)
            (0.001 -490.0  90.0)
            (0.001 -490.0 110.0)
            (0.001 -490.0 130.0)
            (0.001 -490.0 150.0)
            (0.001 -490.0 170.0)
            (0.001 -490.0 190.0)
            (0.001 -490.0 210.0)
            (0.001 -490.0 230.0)
            (0.001 -490.0 250.0)
            (0.001 -490.0 270.0)
            (0.001 -490.0 290.0)
            (0.001 -490.0 310.0)
            (0.001 -490.0 330.0)
            (0.001 -490.0 350.0)
            (0.001 -490.0 370.0)
            (0.001 -490.0 390.0)
            (0.001 -490.0 410.0)
            (0.001 -490.0 430.0)
            (0.001 -490.0 450.0)
            (0.001 -490.0 470.0)
            (0.001 -490.0 490.0)
        );
    }
    southWestMet
    {
        type                probes;
        functionObjectLibs ("libsampling.so");
        name                southMet;
        writeControl        timeStep;
        writeInterval       1;
        fields
        (
            U
        );

        probeLocations
        (
            (-490.0 -490.0  10.0)
            (-490.0 -490.0  30.0)
            (-490.0 -490.0  50.0)
            (-490.0 -490.0  70.0)
            (-490.0 -490.0  90.0)
            (-490.0 -490.0 110.0)
            (-490.0 -490.0 130.0)
            (-490.0 -490.0 150.0)
            (-490.0 -490.0 170.0)
            (-490.0 -490.0 190.0)
            (-490.0 -490.0 210.0)
            (-490.0 -490.0 230.0)
            (-490.0 -490.0 250.0)
            (-490.0 -490.0 270.0)
            (-490.0 -490.0 290.0)
            (-490.0 -490.0 310.0)
            (-490.0 -490.0 330.0)
            (-490.0 -490.0 350.0)
            (-490.0 -490.0 370.0)
            (-490.0 -490.0 390.0)
            (-490.0 -490.0 410.0)
            (-490.0 -490.0 430.0)
            (-490.0 -490.0 450.0)
            (-490.0 -490.0 470.0)
            (-490.0 -490.0 490.0)
        );
    }
    northMet
    {
        type                probes;
        functionObjectLibs ("libsampling.so");
        name                northMet;
        writeControl        timeStep;
        writeInterval       1;
        fields
        (
            U
        );

        probeLocations
        (
            (0.001 490.0  10.0)
            (0.001 490.0  30.0)
            (0.001 490.0  50.0)
            (0.001 490.0  70.0)
            (0.001 490.0  90.0)
            (0.001 490.0 110.0)
            (0.001 490.0 130.0)
            (0.001 490.0 150.0)
            (0.001 490.0 170.0)
            (0.001 490.0 190.0)
            (0.001 490.0 210.0)
            (0.001 490.0 230.0)
            (0.001 490.0 250.0)
            (0.001 490.0 270.0)
            (0.001 490.0 290.0)
            (0.001 490.0 310.0)
            (0.001 490.0 330.0)
            (0.001 490.0 350.0)
            (0.001 490.0 370.0)
            (0.001 490.0 390.0)
            (0.001 490.0 410.0)
            (0.001 490.0 430.0)
            (0.001 490.0 450.0)
            (0.001 490.0 470.0)
            (0.001 490.0 490.0)
        );
    }
    northWestMet
    {
        type                probes;
        functionObjectLibs ("libsampling.so");
        name                northMet;
        writeControl        timeStep;
        writeInterval       1;
        fields
        (
            U
        );

        probeLocations
        (
            (490.0 490.0  10.0)
            (490.0 490.0  30.0)
            (490.0 490.0  50.0)
            (490.0 490.0  70.0)
            (490.0 490.0  90.0)
            (490.0 490.0 110.0)
            (490.0 490.0 130.0)
            (490.0 490.0 150.0)
            (490.0 490.0 170.0)
            (490.0 490.0 190.0)
            (490.0 490.0 210.0)
            (490.0 490.0 230.0)
            (490.0 490.0 250.0)
            (490.0 490.0 270.0)
            (490.0 490.0 290.0)
            (490.0 490.0 310.0)
            (490.0 490.0 330.0)
            (490.0 490.0 350.0)
            (490.0 490.0 370.0)
            (490.0 490.0 390.0)
            (490.0 490.0 410.0)
            (490.0 490.0 430.0)
            (490.0 490.0 450.0)
            (490.0 490.0 470.0)
            (490.0 490.0 490.0)
        );
    }
